Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM6408PL10032.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PM</name>
         <version>06258v1</version>
         <description>Power Manager</description>
         <baseAddress>0x40000400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SLEEPCFG</name>
               <description>Sleep Configuration</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>SLEEPMODE</name>
                     <description>Sleep Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SLEEPMODESelect</name>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>Idle sleep mode enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STANDBY</name>
                           <description>Standby sleep mode enabled</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPCTRL</name>
               <description>Write Protection Control</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPLCK</name>
                     <description>Write Protection Lock</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Allow writes to the WPCTRL register</description>
                           <value>0x505752</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PORT</name>
         <version>U2210v1</version>
         <description>I/O Pin Controller</description>
         <baseAddress>0x41000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x80</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <cluster>
               <dim>1</dim>
               <dimIncrement>0x80</dimIncrement>
               <name>GROUP[%s]</name>
               <description/>
               <addressOffset>0x00</addressOffset>
               <register>
                  <name>DIR</name>
                  <description>Data Direction</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>DIR0</name>
                        <description>Port Data Direction 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR1</name>
                        <description>Port Data Direction 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR2</name>
                        <description>Port Data Direction 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR3</name>
                        <description>Port Data Direction 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR4</name>
                        <description>Port Data Direction 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR5</name>
                        <description>Port Data Direction 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR6</name>
                        <description>Port Data Direction 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR7</name>
                        <description>Port Data Direction 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR8</name>
                        <description>Port Data Direction 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR9</name>
                        <description>Port Data Direction 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR10</name>
                        <description>Port Data Direction 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR11</name>
                        <description>Port Data Direction 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR12</name>
                        <description>Port Data Direction 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR13</name>
                        <description>Port Data Direction 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR14</name>
                        <description>Port Data Direction 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR15</name>
                        <description>Port Data Direction 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR16</name>
                        <description>Port Data Direction 16</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR17</name>
                        <description>Port Data Direction 17</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR18</name>
                        <description>Port Data Direction 18</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR19</name>
                        <description>Port Data Direction 19</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR20</name>
                        <description>Port Data Direction 20</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR21</name>
                        <description>Port Data Direction 21</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR22</name>
                        <description>Port Data Direction 22</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR23</name>
                        <description>Port Data Direction 23</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR24</name>
                        <description>Port Data Direction 24</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR25</name>
                        <description>Port Data Direction 25</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR26</name>
                        <description>Port Data Direction 26</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR27</name>
                        <description>Port Data Direction 27</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR28</name>
                        <description>Port Data Direction 28</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR29</name>
                        <description>Port Data Direction 29</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR30</name>
                        <description>Port Data Direction 30</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR31</name>
                        <description>Port Data Direction 31</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DIRCLR</name>
                  <description>Data Direction Clear</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>DIR0CLR</name>
                        <description>Port Data Direction 0 Clear</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR1CLR</name>
                        <description>Port Data Direction 1 Clear</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR2CLR</name>
                        <description>Port Data Direction 2 Clear</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR3CLR</name>
                        <description>Port Data Direction 3 Clear</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR4CLR</name>
                        <description>Port Data Direction 4 Clear</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR5CLR</name>
                        <description>Port Data Direction 5 Clear</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR6CLR</name>
                        <description>Port Data Direction 6 Clear</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR7CLR</name>
                        <description>Port Data Direction 7 Clear</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR8CLR</name>
                        <description>Port Data Direction 8 Clear</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR9CLR</name>
                        <description>Port Data Direction 9 Clear</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR10CLR</name>
                        <description>Port Data Direction 10 Clear</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR11CLR</name>
                        <description>Port Data Direction 11 Clear</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR12CLR</name>
                        <description>Port Data Direction 12 Clear</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR13CLR</name>
                        <description>Port Data Direction 13 Clear</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR14CLR</name>
                        <description>Port Data Direction 14 Clear</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR15CLR</name>
                        <description>Port Data Direction 15 Clear</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR16CLR</name>
                        <description>Port Data Direction 16 Clear</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR17CLR</name>
                        <description>Port Data Direction 17 Clear</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR18CLR</name>
                        <description>Port Data Direction 18 Clear</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR19CLR</name>
                        <description>Port Data Direction 19 Clear</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR20CLR</name>
                        <description>Port Data Direction 20 Clear</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR21CLR</name>
                        <description>Port Data Direction 21 Clear</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR22CLR</name>
                        <description>Port Data Direction 22 Clear</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR23CLR</name>
                        <description>Port Data Direction 23 Clear</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR24CLR</name>
                        <description>Port Data Direction 24 Clear</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR25CLR</name>
                        <description>Port Data Direction 25 Clear</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR26CLR</name>
                        <description>Port Data Direction 26 Clear</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR27CLR</name>
                        <description>Port Data Direction 27 Clear</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR28CLR</name>
                        <description>Port Data Direction 28 Clear</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR29CLR</name>
                        <description>Port Data Direction 29 Clear</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR30CLR</name>
                        <description>Port Data Direction 30 Clear</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR31CLR</name>
                        <description>Port Data Direction 31 Clear</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
