Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM6408PL10032.svd
               <register>
                  <name>INTFLAG</name>
                  <description>Interrupt Flag Status and Clear</description>
                  <addressOffset>0xA</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>OVF</name>
                        <description>Overflow Interrupt Flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR</name>
                        <description>Error Interrupt Flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC0</name>
                        <description>Match or Capture Channel 0</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC1</name>
                        <description>Match or Capture Channel 1</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>Status</description>
                  <addressOffset>0xB</addressOffset>
                  <size>8</size>
                  <resetValue>0x01</resetValue>
                  <fields>
                     <field>
                        <name>STOP</name>
                        <description>Stop Status Flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SLAVE</name>
                        <description>Client Status Flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PERBUFV</name>
                        <description>Period Buffer Valid</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CCBUFV0</name>
                        <description>Channel 0 Compare or Capture Buffer Valid</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CCBUFV1</name>
                        <description>Channel 1 Compare or Capture Buffer Valid</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WAVE</name>
                  <description>Waveform Generation Control</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>WAVEGEN</name>
                        <description>Waveform Generation Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>WAVEGENSelect</name>
                           <enumeratedValue>
                              <name>NFRQ</name>
                              <description>Normal Frequency Generation mode</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MFRQ</name>
                              <description>Match Frequency Generation mode</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NPWM</name>
                              <description>Normal Pulse-Width Modulation mode</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MPWM</name>
                              <description>Match Pulse-Width Modulation mode</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DRVCTRL</name>
                  <description>Driver Control</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>INVEN0</name>
                        <description>Waveform Output 0 Invert Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INVEN1</name>
                        <description>Waveform Output 1 Invert Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>Debug Control</description>
                  <addressOffset>0xF</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>DBGRUN</name>
                        <description>Run in Debug Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>Synchronization Busy</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>SWRST Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>ENABLE Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTRLB</name>
                        <description>CTRLB Synchronization Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STATUS</name>
                        <description>STATUS Synchronization Busy</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COUNT</name>
                        <description>COUNT Synchronization Busy</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER</name>
                        <description>PER Synchronization Busy</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CC0</name>
                        <description>Compare/Capture Channel 0 Synchronization Busy</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CC1</name>
                        <description>Compare/Capture Channel 1 Synchronization Busy</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>COUNT</name>
                  <description>COUNT16 Counter</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>COUNT</name>
                        <description>Counter Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>2</dim>
                  <dimIncrement>2</dimIncrement>
                  <name>CC[%s]</name>
                  <description>COUNT16 Channel # Compare/Capture</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>CC</name>
                        <description>Channel Compare/Capture Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>2</dim>
                  <dimIncrement>2</dimIncrement>
                  <name>CCBUF[%s]</name>
                  <description>COUNT16 Channel # Compare Buffer</description>
                  <addressOffset>0x30</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>CCBUF</name>
                        <description>Channel Compare Buffer Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <name>COUNT32</name>
               <description>32-bit Counter Mode</description>
               <alternateCluster>COUNT8</alternateCluster>
               <headerStructName>TcCount32</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Timer Counter Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>COUNT16</name>
                              <description>Counter in 16-bit mode</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT8</name>
                              <description>Counter in 8-bit mode</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT32</name>
                              <description>Counter in 32-bit mode</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PRESCSYNC</name>
                        <description>Prescaler and Counter Synchronization</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>PRESCSYNCSelect</name>
                           <enumeratedValue>
                              <name>GCLK</name>
                              <description>Reload or reset the counter on next generic clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PRESC</name>
                              <description>Reload or reset the counter on next prescaler clock</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESYNC</name>
                              <description>Reload or reset the counter on next generic clock. Reset the prescaler counter.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ONDEMAND</name>
                        <description>Clock On Demand</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PRESCALER</name>
                        <description>Prescaler</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>PRESCALERSelect</name>
                           <enumeratedValue>
                              <name>DIV1</name>
                              <description>Prescaler: GCLK_TC</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV2</name>
                              <description>Prescaler: GCLK_TC/2</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV4</name>
                              <description>Prescaler: GCLK_TC/4</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV8</name>
                              <description>Prescaler: GCLK_TC/8</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV16</name>
                              <description>Prescaler: GCLK_TC/16</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV64</name>
                              <description>Prescaler: GCLK_TC/64</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV256</name>
                              <description>Prescaler: GCLK_TC/256</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV1024</name>
                              <description>Prescaler: GCLK_TC/1024</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ALOCK</name>
                        <description>Auto Lock</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAOS</name>
                        <description>DMA One-Shot Trigger Mode</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CAPTEN0</name>
                        <description>Capture Channel 0 Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CAPTEN1</name>
                        <description>Capture Channel 1 Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COPEN0</name>
                        <description>Capture On Pin 0 Enable</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COPEN1</name>
                        <description>Capture On Pin 1 Enable</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CAPTMODE0</name>
                        <description>Capture mode Channel 0</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>CAPTMODE0Select</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Default capture</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTMIN</name>
                              <description>Minimum capture</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTMAX</name>
                              <description>Maximum capture</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CAPTMODE1</name>
                        <description>Capture mode Channel 1</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>CAPTMODE1Select</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Default capture</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTMIN</name>
                              <description>Minimum capture</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTMAX</name>
                              <description>Maximum capture</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
